var locales = {

    'en-US': {
        calendar: {
            months: [
                "January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December",
                "Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"
            ],
            days: [
                "Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday",
                "Su", "Mo", "Tu", "We", "Th", "Fr", "Sa",
                "Sun", "Mon", "Tus", "Wen", "Thu", "Fri", "Sat"
            ]
        },
        buttons: {
            ok: "OK",
            cancel: "Cancel",
            done: "Done",
            today: "Today",
            clear: "Clear",
            help: "Help",
            yes: "Yes",
            no: "No",
            rand: "Random"
        }
    },

    'uk-UA': {
        calendar: {
            months: [
                "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень", "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень",
                "Січ", "Лют", "Бер", "Кві", "Тра", "Чер", "Лип", "Сер", "Вер", "Жов", "Лис", "Гру"
            ],
            days: [
                "Неділя", "Понеділок", "Вівторок", "Середа", "Четвер", "П’ятниця", "Субота",
                "Нд", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб",
                "Нед", "Пон", "Вiв", "Сер", "Чет", "Пят", "Суб"
            ]
        },
        buttons: {
            ok: "ОК",
            cancel: "Відміна",
            done: "Готово",
            today: "Сьогодні",
            clear: "Очистити",
            help: "Допомога",
            yes: "Так",
            no: "Ні",
            rand: "Випадково"
        }
    },

    'ru-RU': {
        calendar: {
            months: [
                "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь",
                "Янв", "Фев", "Мар", "Апр", "Май", "Июн", "Июл", "Авг", "Сен", "Окт", "Ноя", "Дек"
            ],
            days: [
                "Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота",
                "Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб",
                "Вос", "Пон", "Вто", "Сре", "Чет", "Пят", "Суб"
            ]
        },
        buttons: {
            ok: "ОК",
            cancel: "Отмена",
            done: "Готово",
            today: "Сегодня",
            clear: "Очистить",
            help: "Помощь",
            yes: "Да",
            no: "Нет",
            rand: "Случайно"
        }
    }
};

window.coreLocales = locales;
